xfa273/nightfall-fw/platform/stm32f413/HM_Nightfall_f413_preorder/Core/Inc/f413_wall_sensor.h
#ifndef F413_WALL_SENSOR_H_
#define F413_WALL_SENSOR_H_

#include <stdbool.h>
#include <stdint.h>

#include "stm32f4xx_hal.h"

typedef struct
{
  uint16_t fr_off;
  uint16_t r_off;
  uint16_t fl_off;
  uint16_t l_off;
  uint16_t vbat_off;
  uint16_t fr_on;
  uint16_t r_on;
  uint16_t fl_on;
  uint16_t l_on;
  uint16_t vbat_on;
  int32_t fr_delta;
  int32_t r_delta;
  int32_t fl_delta;
  int32_t l_delta;
  bool front_wall;
  bool right_wall;
  bool left_wall;
  bool saturated;
} f413_wall_sensor_snapshot_t;

bool f413_wall_sensor_start_async(void);
void f413_wall_sensor_tim6_tick(void);
void f413_wall_sensor_adc_complete(ADC_HandleTypeDef* hadc);
bool f413_wall_sensor_read_snapshot(f413_wall_sensor_snapshot_t* out);
bool f413_wall_sensor_read_adc_raw(uint16_t* fr, uint16_t* r, uint16_t* fl, uint16_t* l, uint16_t* vbat);
void f413_wall_sensor_get_debug_state(uint16_t* off_r,
                                      uint16_t* off_l,
                                      uint16_t* off_fr,
                                      uint16_t* off_fl,
                                      uint8_t* ready_mask,
                                      uint8_t* phase,
                                      uint8_t* inflight);

#endif
